app/Models/ModelLokasi.php

    public function insertData($data)
    {
        $this->db->table('tbl_lokasi')->insert($data);
---
INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('gedung B', 'FT Unsoed', '-7.428544008683081', '109.33677434921266', '1702311817_af34b99f148eefa7e6a6.png')

    public function getAllData()
    {
        return $this->db->table('tbl_lokasi')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_lokasi`